Revit 2021.1 API
InternalOrigin Class
 A class representing the origin of internal coordinate system. Each Revit project contains one InternalOrigin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2021
Syntax
C#
public class InternalOrigin : Element
Visual Basic
Public Class InternalOrigin _
	Inherits Element
Visual C++
public ref class InternalOrigin : public Element
Remarks
 The internal origin cannot be selected (e.g. as a reference) nor can it be modified.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.InternalOrigin
See Also
InternalOrigin Members
Autodesk.Revit.DB Namespace